analogdevicesinc/msdk/Libraries/Boards/MAX32520/Simulation/Include/test_regs.h
/**
 * @file    test_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the TEST Peripheral Module.
 */

/******************************************************************************
 *
 * Copyright 2023 Analog Devices, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 *
 * Copyright (C) 2023 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 ******************************************************************************/

#ifndef _TEST_REGS_H_
#define _TEST_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     test
 * @defgroup    test_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions for the TEST Peripheral Module.
 * @description Test Modes
 */

/**
 * @ingroup test_registers
 * Structure type to access the TEST Registers.
 */
typedef struct {
    __IO uint32_t tm;                   /**< <tt>\b 0x00:<\tt> TEST TM Register */
    __IO uint32_t trcn;                 /**< <tt>\b 0x04:<\tt> TEST TRCN Register */
    __IO uint32_t tclk;                 /**< <tt>\b 0x08:<\tt> TEST TCLK Register */
    __IO uint32_t tmr0;                 /**< <tt>\b 0x0C:<\tt> TEST TMR0 Register */
    __IO uint32_t tmr1;                 /**< <tt>\b 0x10:<\tt> TEST TMR1 Register */
    __IO uint32_t tmr2;                 /**< <tt>\b 0x14:<\tt> TEST TMR2 Register */
    __IO uint32_t tmr3;                 /**< <tt>\b 0x18:<\tt> TEST TMR3 Register */
    __IO uint32_t stcr;                 /**< <tt>\b 0x1C:<\tt> TEST STCR Register */
    __IO uint32_t mbcn;                 /**< <tt>\b 0x20:<\tt> TEST MBCN Register */
    __IO uint32_t mbstat;               /**< <tt>\b 0x24:<\tt> TEST MBSTAT Register */
    __IO uint32_t mbdsel;               /**< <tt>\b 0x28:<\tt> TEST MBDSEL Register */
    __IO uint32_t mbdiag;               /**< <tt>\b 0x2C:<\tt> TEST MBDIAG Register */
} mxc_test_regs_t;

/**
 * @ingroup  test_registers
 * @defgroup TM_Register
 * @brief    Test Mode
 * @{
 */
#define MXC_F_TEST_TM_TME_POS                          (0) /**< TM_TME Position */
#define MXC_F_TEST_TM_TME                              ((uint32_t)(0x1 << MXC_F_TEST_TM_TME_POS)) /**< TM_TME Mask */

#define MXC_F_TEST_TM_TTAP_EN_POS                      (1) /**< TM_TTAP_EN Position */
#define MXC_F_TEST_TM_TTAP_EN                          ((uint32_t)(0x1 << MXC_F_TEST_TM_TTAP_EN_POS)) /**< TM_TTAP_EN Mask */

#define MXC_F_TEST_TM_TTAP_PIF_POS                     (2) /**< TM_TTAP_PIF Position */
#define MXC_F_TEST_TM_TTAP_PIF                         ((uint32_t)(0x1 << MXC_F_TEST_TM_TTAP_PIF_POS)) /**< TM_TTAP_PIF Mask */

#define MXC_F_TEST_TM_SCAN_POS                         (3) /**< TM_SCAN Position */
#define MXC_F_TEST_TM_SCAN                             ((uint32_t)(0x1 << MXC_F_TEST_TM_SCAN_POS)) /**< TM_SCAN Mask */

#define MXC_F_TEST_TM_SCANFB_POS                       (4) /**< TM_SCANFB Position */
#define MXC_F_TEST_TM_SCANFB                           ((uint32_t)(0x1 << MXC_F_TEST_TM_SCANFB_POS)) /**< TM_SCANFB Mask */

#define MXC_F_TEST_TM_SRT_POS                          (5) /**< TM_SRT Position */
#define MXC_F_TEST_TM_SRT                              ((uint32_t)(0x1 << MXC_F_TEST_TM_SRT_POS)) /**< TM_SRT Mask */

#define MXC_F_TEST_TM_IDDQ_POS                         (6) /**< TM_IDDQ Position */
#define MXC_F_TEST_TM_IDDQ                             ((uint32_t)(0x1 << MXC_F_TEST_TM_IDDQ_POS)) /**< TM_IDDQ Mask */

#define MXC_F_TEST_TM_XTALSEL_POS                      (7) /**< TM_XTALSEL Position */
#define MXC_F_TEST_TM_XTALSEL                          ((uint32_t)(0x1 << MXC_F_TEST_TM_XTALSEL_POS)) /**< TM_XTALSEL Mask */

#define MXC_F_TEST_TM_LDOOFF_POS                       (9) /**< TM_LDOOFF Position */
#define MXC_F_TEST_TM_LDOOFF                           ((uint32_t)(0x1 << MXC_F_TEST_TM_LDOOFF_POS)) /**< TM_LDOOFF Mask */

#define MXC_F_TEST_TM_FTM_POS                          (10) /**< TM_FTM Position */
#define MXC_F_TEST_TM_FTM                              ((uint32_t)(0x1 << MXC_F_TEST_TM_FTM_POS)) /**< TM_FTM Mask */

#define MXC_F_TEST_TM_SFTM_POS                         (11) /**< TM_SFTM Position */
#define MXC_F_TEST_TM_SFTM                             ((uint32_t)(0x1 << MXC_F_TEST_TM_SFTM_POS)) /**< TM_SFTM Mask */

#define MXC_F_TEST_TM_FBIST_POS                        (12) /**< TM_FBIST Position */
#define MXC_F_TEST_TM_FBIST                            ((uint32_t)(0x1 << MXC_F_TEST_TM_FBIST_POS)) /**< TM_FBIST Mask */

