analogdevicesinc/msdk/Libraries/Boards/MAX32520/Simulation/Include/test_regs.h
#define MXC_F_TEST_MBCN_ICACHE_POS                     (3) /**< MBCN_ICACHE Position */
#define MXC_F_TEST_MBCN_ICACHE                         ((uint32_t)(0x1 << MXC_F_TEST_MBCN_ICACHE_POS)) /**< MBCN_ICACHE Mask */

#define MXC_F_TEST_MBCN_CRYPTO_POS                     (5) /**< MBCN_CRYPTO Position */
#define MXC_F_TEST_MBCN_CRYPTO                         ((uint32_t)(0x1 << MXC_F_TEST_MBCN_CRYPTO_POS)) /**< MBCN_CRYPTO Mask */

#define MXC_F_TEST_MBCN_ICACHEXIP_POS                  (11) /**< MBCN_ICACHEXIP Position */
#define MXC_F_TEST_MBCN_ICACHEXIP                      ((uint32_t)(0x1 << MXC_F_TEST_MBCN_ICACHEXIP_POS)) /**< MBCN_ICACHEXIP Mask */

#define MXC_F_TEST_MBCN_SYSRAM3_POS                    (16) /**< MBCN_SYSRAM3 Position */
#define MXC_F_TEST_MBCN_SYSRAM3                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SYSRAM3_POS)) /**< MBCN_SYSRAM3 Mask */

#define MXC_F_TEST_MBCN_SYSRAM4_POS                    (17) /**< MBCN_SYSRAM4 Position */
#define MXC_F_TEST_MBCN_SYSRAM4                        ((uint32_t)(0x1 << MXC_F_TEST_MBCN_SYSRAM4_POS)) /**< MBCN_SYSRAM4 Mask */

/**@} end of group MBCN_Register */

/**
 * @ingroup  test_registers
 * @defgroup MBSTAT_Register
 * @brief    Memory BIST Status Register.
 * @{
 */
#define MXC_F_TEST_MBSTAT_SYSRAM1_POS                  (0) /**< MBSTAT_SYSRAM1 Position */
#define MXC_F_TEST_MBSTAT_SYSRAM1                      ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SYSRAM1_POS)) /**< MBSTAT_SYSRAM1 Mask */

#define MXC_F_TEST_MBSTAT_SYSRAM2_POS                  (1) /**< MBSTAT_SYSRAM2 Position */
#define MXC_F_TEST_MBSTAT_SYSRAM2                      ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SYSRAM2_POS)) /**< MBSTAT_SYSRAM2 Mask */

#define MXC_F_TEST_MBSTAT_ICACHE_POS                   (3) /**< MBSTAT_ICACHE Position */
#define MXC_F_TEST_MBSTAT_ICACHE                       ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_ICACHE_POS)) /**< MBSTAT_ICACHE Mask */

#define MXC_F_TEST_MBSTAT_CRYPTO_POS                   (5) /**< MBSTAT_CRYPTO Position */
#define MXC_F_TEST_MBSTAT_CRYPTO                       ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_CRYPTO_POS)) /**< MBSTAT_CRYPTO Mask */

#define MXC_F_TEST_MBSTAT_ICACHEXIP_POS                (11) /**< MBSTAT_ICACHEXIP Position */
#define MXC_F_TEST_MBSTAT_ICACHEXIP                    ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_ICACHEXIP_POS)) /**< MBSTAT_ICACHEXIP Mask */

#define MXC_F_TEST_MBSTAT_SYSRAM3_POS                  (16) /**< MBSTAT_SYSRAM3 Position */
#define MXC_F_TEST_MBSTAT_SYSRAM3                      ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SYSRAM3_POS)) /**< MBSTAT_SYSRAM3 Mask */

#define MXC_F_TEST_MBSTAT_SYSRAM4_POS                  (17) /**< MBSTAT_SYSRAM4 Position */
#define MXC_F_TEST_MBSTAT_SYSRAM4                      ((uint32_t)(0x1 << MXC_F_TEST_MBSTAT_SYSRAM4_POS)) /**< MBSTAT_SYSRAM4 Mask */

/**@} end of group MBSTAT_Register */

/*******************************************************************************/
/*                                                                        Test */
#define MXC_BASE_TEST                    ((uint32_t)0x40000C00UL)
#define MXC_TEST                         ((mxc_test_regs_t*)MXC_BASE_TEST)
#define MXC_TEST_INSTANCES               (1)

#ifdef __cplusplus
}
#endif

#endif /* _TEST_REGS_H_ */

